---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ObjsDemolished
source: html/136447dc-2cb2-4f22-0483-8b956e5c78a2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ObjsDemolished Property

Cannot assign [Element] to circuit. Objects that are demolished cannot be added to a circuit.

## Syntax (C#)
```csharp
public static FailureDefinitionId ObjsDemolished { get; }
```